FemDesign.Loads.LoadGroupBase
load_base_attribs

FemDesign.Loads.LoadGroupBase.AddLoadCase(FemDesign.Loads.LoadCase)
Add LoadCase to group.

FemDesign.Loads.LoadGroupBase.GetCorrespondingCompleteLoadCase(FemDesign.Loads.ModelLoadCaseInGroup)
Find the corresponding LoadCase instance stored in the load group based on the guid of the modelLoadCaseInGroup instance
modelLoadCaseInGroup: Model load case to find corresponding complete LoadCase instance of
Returns: The LoadCase that has the same guid

FemDesign.Loads.LoadGroupBase.LoadCaseInLoadGroup(FemDesign.Loads.LoadCase)
Check if LoadCase in LoadGroup.